{
  "alerts": [],
  "categories": [
    {
      "description": "Visit these twelve “must-see” sites for a glimpse into Skagway’s colorful past—and present.",
      "name": "Highlights",
      "sites": [
        383,
        384,
        385,
        386,
        387,
        388,
        389,
        390
      ]
    },
    {
      "name": "Favorites"
    },
    {
      "name": "Nearby"
    },
    {
      "name": "Good for Families"
    },
    {
      "description": "For BETA Test only",
      "name": "HEHO/FOSM"
    },
    {
      "name": "Lesser Known"
    }
  ],
  "description": "The landscape and buildings of HEHO tell how family, faith, education, and hard work opened a world of opportunity to a child of simple beginnings.",
  "designation": "National Historic Site",
  "events": [],
  "map_thumbnail_zoom": 16,
  "max_distance_in_meters": 1609.3,
  "media": [],
  "more": [
    {
      "disp_order": 1,
      "name": "Presidential Library",
      "type": "SPECIAL_INFO1"
    },
    {
      "disp_order": 2,
      "name": "Park Info & FAQs",
      "type": "INFORMATION"
    },
    {
      "disp_order": 3,
      "name": "Settings",
      "type": "DOWNLOAD"
    },
    {
      "disp_order": 4,
      "name": "Today",
      "type": "EVENTS"
    },
    {
      "disp_order": 5,
      "name": "Accessibility",
      "type": "ACCESSIBILITY"
    },
    {
      "disp_order": 6,
      "is_feature": true,
      "name": "Postcard",
      "type": "POSTCARD"
    },
    {
      "disp_order": 7,
      "name": "Search",
      "type": "SEARCH"
    }
  ],
  "name": "Herbert Hoover",
  "searches": [
    "HEHO suggested search 1"
  ],
  "sites": [
    {
      "description": "In the years following his presidency, Herbert and Lou Hoover restored the president's humble birthplace, which he called \"physical proof of the unbounded opportunity of American life.\" The small spaces and dearth of material possession reflect an ethic of thrift, and the cottage's status as a starter home for a young family. Antique furnishings from the mid and late 19th century represent common household items for a simply furnished two room rural home.",
      "geofence_buffer_in_meters": 10,
      "id": 384,
      "latitude": 41.6702711748314,
      "longitude": -91.3468685746193,
      "name": "Birthplace Cottage",
      "type": "Home"
    },
    {
      "description": "Start your visit at the Visitor Center, where you can pick up a map and guide. Park rangers are available to answer questions and help you get oriented.",
      "geofence_buffer_in_meters": 10,
      "id": 383,
      "latitude": 41.6708722415851,
      "longitude": -91.3456910848618,
      "name": "Visitor Center",
      "type": "Information"
    },
    {
      "description": "The bronze, seven and a half foot tall statue “Isis, Goddess of Life” is the work of Belgian sculptor Auguste Puttemans, and was a gift from the people of Belgium in gratitude for Hoover's famine relief efforts on their behalf during the First World War.",
      "geofence_buffer_in_meters": 10,
      "id": 388,
      "latitude": 41.6696881347181,
      "longitude": -91.3469356298447,
      "name": "Statue of Isis",
      "type": "Statue"
    },
    {
      "description": "Herbert Hoover grew up in a religious community that valued peace, simplicity, integrity, and service to others. The plainly furnished Friends Meetinghouse, built by the Society of Friends, or Quakers, in 1857, is the physical expression of those values. Now two blocks from its original location, the Herbert Hoover Birthplace Foundation relocated and restored this meetinghouse in 1964.",
      "geofence_buffer_in_meters": 10,
      "id": 387,
      "latitude": 41.6697642708402,
      "longitude": -91.3463267683983,
      "name": "Friends Meetinghouse",
      "type": "Church"
    },
    {
      "description": "Jesse Hoover owned and operated a blacksmith shop from 1871 to 1878. Although there were other smithies in town, Jesse earned a reputation as a good-natured, fair, and industrious businessman. Skilled and ambitious, he advertised to farmers, “Horse shoeing and plow work a specialty. Also dealer in all kinds of pumps. Prices to suit the times.”",
      "geofence_buffer_in_meters": 10,
      "id": 385,
      "latitude": 41.6704454847677,
      "longitude": -91.3470885157585,
      "name": "Blacksmith Shop",
      "type": "Shop"
    },
    {
      "description": "Herbert Hoover recalled, “Iowa in those years was filled with days of school, and who does not remember with a glow, some gentle woman, who with infinite patience and kindness, drilled into us those foundations of all we know today.”",
      "geofence_buffer_in_meters": 10,
      "id": 386,
      "latitude": 41.6705426573434,
      "longitude": -91.3473741710186,
      "name": "Schoolhouse",
      "type": "School"
    },
    {
      "description": "On August 12, 1965, an act of Congress established this park as a national historic site. Since then, the National Park Service has preserved and interpreted the historic structures and landscape of this 187-acre park. In the late 1930's, President Hoover and his wife, Lou Henry Hoover, chose this place to celebrate the values they believed helped shape his life.",
      "geofence_buffer_in_meters": 10,
      "id": 391,
      "latitude": 41.6704234456064,
      "longitude": -91.3461765646935,
      "name": "Visitor Center Orientation Wayside",
      "type": "Exhibit"
    },
    {
      "description": "For thirty-six years Dr. L.J. Leech, a Civil War veteran and graduate of Iowa State University, had lived in the Laban Miles House next door; renting it at first in 1884, and then buying it two years later when the bank foreclosed on the home. By 1920, the well-liked country doctor and Iowa legislator decided to have a new home built for himself.",
      "geofence_buffer_in_meters": 10,
      "id": 399,
      "latitude": 41.6706899185961,
      "longitude": -91.3464125990868,
      "name": "L.J. Leech House",
      "type": "Office"
    },
    {
      "description": "Hannah Varney built this house in 1899 shortly after divorcing her husband. The West Branch Times described the house as being of \"fine appearance and finished in modern style.\" After living in the house with her six children for less than one year, Hannah Varney moved to Iowa City and married Robert Ward. She left the house to her daughters, Cora and Clara, who lived in it until 1915. In 1967 the National Park Service moved the Hannah Varney House from its original location on the lot just south of where it now stands on Downey Street.",
      "geofence_buffer_in_meters": 10,
      "id": 398,
      "latitude": 41.6705196164367,
      "longitude": -91.3464313745499,
      "name": "Hannah Varney House",
      "type": "Office"
    },
    {
      "description": "The 81 acres of tallgrass prairie reconstructed here offer a glimpse of an Iowa landscape that had almost vanished by the time Herbert Hoover's grandparents moved here in 1854. Prior to the settlement of West Branch, prairie covered 85 percent of Iowa. Trees were scarce until planted; the Hoovers imported lumber from farther north for construction of the president’s birthplace. Tall native grasses, sprinkled with brilliantly colored wildflowers once covered these rolling hills for as far as the eye could see.",
      "geofence_buffer_in_meters": 10,
      "id": 395,
      "latitude": 41.6676644837336,
      "longitude": -91.3512325286865,
      "name": "Tallgrass Prairie at the Observation Deck",
      "type": "Trailhead"
    },
    {
      "geofence_buffer_in_meters": 10,
      "id": 392,
      "latitude": 41.6702611570046,
      "longitude": -91.346989274025,
      "name": "Birthplace Cottage Back Porch and Garden"
    },
    {
      "description": "Herbert Hoover wrote of West Branch, \"My grandparents and my parents came here in a covered wagon. In this community they toiled and worshipped God. The most formative years of my boyhood were spent here. My roots are in this soil.\"",
      "geofence_buffer_in_meters": 10,
      "id": 390,
      "latitude": 41.6681653933666,
      "longitude": -91.3519969582558,
      "name": "Gravesite of President and Mrs. Hoover",
      "type": "Graves"
    },
    {
      "description": "In 1871 young Jesse Hoover constructed a blacksmith and wagon repair shop here on the corner of Penn and Downey streets. His business thrived in the rapidly growing village. In 1878 Jesse sold both his shop and the small cottage he had built across Penn Street, and opened a farm implement business a few blocks away on Main Street. In 1888 the original building was moved to another part of town, and was subsequently lost to history.",
      "geofence_buffer_in_meters": 10,
      "id": 393,
      "latitude": 41.6704414776481,
      "longitude": -91.3468243181705,
      "name": "Blacksmith Shop Original Site",
      "type": "Site"
    },
    {
      "description": "In 1951 Herbert Hoover became the first recipient of the prestigious Iowa Award, which is bestowed to “recognize the outstanding service of Iowans in the fields of science, medicine, law, religion, social welfare education, agriculture, industry, government and other public service.” Only 12 other Iowans have received this award.",
      "geofence_buffer_in_meters": 10,
      "id": 394,
      "latitude": 41.6697041633829,
      "longitude": -91.3468819856644,
      "name": "Iowa Award",
      "type": "Plaque"
    },
    {
      "description": "The South Downey Street Bridge extends across a tributary of the West Branch of the Wapsinonoc Creek. When Herbert Hoover was a boy, it was just a small stream of water trickling through marshy wetlands. Young Herbert and the neighborhood kids took their willow fishing poles about a quarter mile east to catch sunfish and catfish in the main creek.",
      "geofence_buffer_in_meters": 10,
      "id": 396,
      "latitude": 41.6699936804532,
      "longitude": -91.3466472923756,
      "name": "Hoover Creek at the South Downey Street Bridge",
      "type": "Bridge"
    },
    {
      "description": "West Branch boomed between 1869 and 1873. New buildings constructed in the neighborhood near the Hoovers’ small cottage on Downey Street included the Laban Miles House, the Garvin House, and the Methodist Church, which is no longer standing. When the Burlington, Cedar Rapids & Northern Railroad arrived in West Branch on December 20, 1870, two hundred of the town’s residents celebrated with a picnic dinner.",
      "geofence_buffer_in_meters": 10,
      "id": 397,
      "latitude": 41.6703653423269,
      "longitude": -91.3466191291809,
      "name": "Historic Homes on Downey Street (incl. WS)",
      "type": "Block"
    },
    {
      "description": "In 1870, real-estate developer J.M. Wetherell sold three lots to E.S. Hayhurst. Hayhurst built his house here in 1872. Unfortunately, Hayhurst and his family were only able to call this place home for less than a decade. When they couldn't make the payments, the mortgage was foreclosed and the family left town in 1878. Ever the businessman, Wetherell repossessed the lots and turned the house into a rental property.",
      "geofence_buffer_in_meters": 10,
      "id": 407,
      "latitude": 41.6705496697917,
      "longitude": -91.3477858901024,
      "name": "E.S. Hayhurst House",
      "type": "Residence"
    },
    {
      "description": "In 1873, J. M. Wetherell sold two lots to Mary Wright. She owned the property for the next 48 years. Her husband, William “Billy” Wright, owned a blacksmith shop at the southwest corner of Main and Poplar streets. Perhaps the competition from neighbor Jesse Hoover, Herbert’s dad, was what led Billy to sell his business in 1875 and open a harness and boot shop.",
      "geofence_buffer_in_meters": 10,
      "id": 406,
      "latitude": 41.6707420109314,
      "longitude": -91.3478341698647,
      "name": "Mary Wright House",
      "type": "Residence"
    },
    {
      "description": "The main wing of this white, two-story wood frame structure was completed in 1872, two years before Herbert Hoover was born. Dr. James Staples and his wife Eliza bought it in 1876. The couple, originally from Vermont, had decided to retire in West Branch. When the 76-year old doctor passed away in 1891, he left the home to his four grandchildren. The Staples house has since become a part of the historic village landscape from Herbert Hoover's youth.",
      "geofence_buffer_in_meters": 10,
      "id": 405,
      "latitude": 41.6708802557705,
      "longitude": -91.3478395342827,
      "name": "James Staples House",
      "type": "Residence"
    },
    {
      "description": "In 1869, carpenter David Mackey, who designed and built this humble two-story home. The cheerful yellow house would have been a familiar landmark to the young Herbert Hoover.  Just a few years after construction was complete, David’s wife Mary died, leaving the carpenter with a baby son named Charles. The young widower, one of the town's few Democrats, was elected the Mayor of West Branch in 1879. Of the homes in the core area dating back to Hoover's boyhood, this house and the Wright House, across the street, have been the least altered in appearance.",
      "geofence_buffer_in_meters": 10,
      "id": 404,
      "latitude": 41.6708542096641,
      "longitude": -91.3474291563034,
      "name": "David Mackey House",
      "type": "Residence"
    },
    {
      "description": "Charles E. Smith was a carpenter and a Civil War veteran. In 1903, he completed his dream home for himself and his wife, Deborah, atop Cooks Hill where each spring, he would tap his maple trees to make maple syrup. The National Park Service relocated it here in 1969.",
      "geofence_buffer_in_meters": 10,
      "id": 402,
      "latitude": 41.6707099541147,
      "longitude": -91.3469302654266,
      "name": "C.E. Smith House",
      "type": "Office"
    },
    {
      "description": "Amanda Garvin was a single 35-year old woman when she bought this property in 1870 for $90.00. She had this cottage built by 1872. The Garvin house is a wonderful example of the Gothic Revival style with its steeply pitched roof, gingerbread bargeboard trim, and ornamental arches framing the open front porch. By 1878, Miss Garvin was renting her cottage to tenants. During the fifteen years she owned the property, she mortgaged it several times but lost the home to foreclosure in 1885.",
      "geofence_buffer_in_meters": 10,
      "id": 401,
      "latitude": 41.6708762486779,
      "longitude": -91.3469222187996,
      "name": "Amanda Garvin House",
      "type": "Office"
    },
    {
      "description": "West Branch was barely a settlement in 1852 when Baltimore native Aaron Baker came here to claim the free land he'd received from the United States government for his service in the Mexican War. He promptly sold all 160 acres of it for about a dollar apiece.",
      "geofence_buffer_in_meters": 10,
      "id": 403,
      "latitude": 41.6710084826023,
      "longitude": -91.3475766777992,
      "name": "Historic Homes on Poplar Street",
      "type": "Block"
    },
    {
      "description": "The P.T. Smith House is the only house that Herbert Hoover remembered when he visited West Branch many years later. While living in the House of Maples, the Hoover children and Smith children were playmates. Their homes stood at the base of Cook's Hill, a favorite winter sledding spot. Hoover recalled, \"That was a great long hill where on winters’ nights, to satisfy our human craving for speed, we slid down at terrific pace with our tummies tight to home-made sleds.\"",
      "geofence_buffer_in_meters": 10,
      "id": 409,
      "latitude": 41.6685971743425,
      "longitude": -91.3464595377445,
      "name": "P.T. Smith House",
      "type": "Historic Building"
    },
    {
      "description": "In 1938 Lou Henry Hoover suggested establishing an organization to own and manage the birthplace. The Herbert Hoover Birthplace Society was organized the following year.",
      "geofence_buffer_in_meters": 10,
      "id": 412,
      "latitude": 41.668303643739,
      "longitude": -91.3470911979675,
      "name": "Hoover Presidential Foundation",
      "type": "Nonprofit"
    },
    {
      "description": "A lone maple tree grows on the land where the Hoover family's second home once stood. The one-acre parcel, on the corner of Downey and Cedar streets, had a two-story frame house with two chimneys. Maple trees lined the front yard and a wild crabapple tree grew in back of the spacious four-room home.",
      "geofence_buffer_in_meters": 10,
      "id": 408,
      "latitude": 41.6688105592313,
      "longitude": -91.3463777303696,
      "name": "House of the Maples Site",
      "type": "Site"
    },
    {
      "description": "Isaac Miles was a widower with two young daughters when he moved to West Branch in 1874 and opened a drugstore. Three years later, he met and married a young woman, who had inherited 100 acres of farmland to the southwest of the Hoover cottage. So Miles sold his drugstore and decided to give farming a try. And as soon as the two-story frame house and barn were built, the new family moved in. Isaac's daughters, Providence and Abbie were around the same age as the Hoover children, and it's likely they played together in this rural playground filled with natural wonders.",
      "geofence_buffer_in_meters": 10,
      "id": 410,
      "latitude": 41.666173753608,
      "longitude": -91.3476249575615,
      "name": "Isaac Miles Farmstead",
      "type": "Historic Buildings"
    },
    {
      "description": "The Hoover Nature Trail follows the railroad that passed through the president’s hometown.",
      "geofence_buffer_in_meters": 10,
      "id": 414,
      "latitude": 41.6676264144421,
      "longitude": -91.3510823249817,
      "name": "Hoover Nature Trail",
      "type": "Trailhead"
    },
    {
      "description": "James Townsend owned Traveler's Rest, an inn where abolitionist John Brown stayed when passing through West Branch in 1856. Brown later trained part of his army in nearby Springdale for their 1859 attack on Harper's Ferry, Virigina. The raiders included two young local men, brothers Barclay and Edwin Coppock.",
      "geofence_buffer_in_meters": 10,
      "id": 415,
      "latitude": 41.6714522656813,
      "longitude": -91.3362523913383,
      "name": "Traveler's Rest",
      "type": "Inn"
    },
    {
      "description": "Charles F. Schroeder had this building constructed in 1912 for his men’s clothing store. The modern store boasted large display windows and electric lights. since that time, several shops have used the building and made alterations to its interior.",
      "geofence_buffer_in_meters": 10,
      "id": 417,
      "latitude": 41.6715955178053,
      "longitude": -91.3465386629105,
      "name": "Leech Building (1912), 103 N. Downey Street",
      "type": "Store"
    },
    {
      "description": "In 1909 Citizens' Savings Bank relocated here on the northeast corner of North Downey and Main streets. Surviving the collapse of farm prices in 1921 but not the Great Depression, it was absorbed in 1934 by the West Branch State Bank, creating the First State Bank.",
      "geofence_buffer_in_meters": 10,
      "id": 416,
      "latitude": 41.6715354120579,
      "longitude": -91.3465386629105,
      "name": "Citizens' Savings Bank (1908), 101 N. Downey Street",
      "type": "Bank"
    },
    {
      "description": "Charles A. Macomber constructed the most ambitious project of the era in 1895. The two-story Opera Block is still the largest commercial building downtown. Three stores shared the first floor. the top floor included the Masonic Lodge and a 500 seat heater with a 20 by 40 foot stage. “The Pastime” motion picture house took the upper space in 1912. A woodworking and antique store occupied the first floor prior to its restoration in 1986.",
      "geofence_buffer_in_meters": 10,
      "id": 419,
      "latitude": 41.6718319332009,
      "longitude": -91.3465413451195,
      "name": "The Opera Block (1895) 107-109 N. Downey Street",
      "type": "Theater"
    },
    {
      "description": "The War Memorial Building, built in 1948, honors veterans of World War II. The first floor served as the post office and the local American Legion used the basement and upstairs. An antique shop replaced the post office in 1970.",
      "geofence_buffer_in_meters": 10,
      "id": 423,
      "latitude": 41.67152940148,
      "longitude": -91.3470321893692,
      "name": "War Memorial Building (1947), 105 W. Main Street",
      "type": "Post Office"
    },
    {
      "description": "Bert Leech and Harry Gruwell entered a partnership to build a garage and plumbing shop here in 1911. the members of the local masonic Lodge helped construct this two-story brick building that would house the garage and plumbing shop on the street level and the lodge rooms on the second floor.",
      "geofence_buffer_in_meters": 10,
      "id": 418,
      "latitude": 41.6716896833636,
      "longitude": -91.3465440273285,
      "name": "Leech-Gruwell Garage (1911) 105 N. Downey",
      "type": "Shop"
    },
    {
      "description": "T. Butler and Dr. L.J. Leech agreed to jointly finance this structure in 1895. The west half of the building housed a meat market on the first floor and the lodge of the Modern Woodmen of American on the second. The east side was rented to Bert Gill for the union Block Drug Store. Since then the building has housed several shops, cafes, and offices.",
      "geofence_buffer_in_meters": 10,
      "id": 424,
      "latitude": 41.6712709461022,
      "longitude": -91.3471072912216,
      "name": "The Union Block (1895),  106-108 W. Main Street",
      "type": "Market"
    },
    {
      "description": "West Branch Bank was founded here in 1875 but moved across Main Street three years later. A variety of shops used this building over the years. In 1965 owners closed the original front door and cut an interior passage on the east into the building next door.",
      "geofence_buffer_in_meters": 10,
      "id": 422,
      "latitude": 41.6712789602381,
      "longitude": -91.3461631536484,
      "name": "West Branch Bank (1875), 104 W. Main Street",
      "type": "Bank"
    },
    {
      "description": "Nate Crook owned and operated a barber shop and restaurant in this building in 1871. By 1877 he had expanded his operation to include a hotel and livery. Over the years the building has housed several hotels and restaurants.",
      "geofence_buffer_in_meters": 10,
      "id": 421,
      "latitude": 41.6712649354997,
      "longitude": -91.3458117842674,
      "name": "Crook's Hotel (1870), 102 W. Main Street",
      "type": "Hotel"
    },
    {
      "description": "In March 1890 Lavina Patterson opened a millinery shop here and lived with ther family upstairs. Dr. L.J. Leech moved his medical offices here after fire damaged the buildings across the street in 1895. It remained Dr. Leech's office until his death in 1937.",
      "geofence_buffer_in_meters": 10,
      "id": 425,
      "latitude": 41.671531405006,
      "longitude": -91.3471287488937,
      "name": "Patterson-Leech Building (1890), 107 W. Main Street",
      "type": "Shop"
    },
    {
      "description": "Commercial growth prompted the establishment of a second downtown bank in 1898. In 1898 the Citizens' Savings Bank moved into the new brick building. The principal shareholders used local material dealers and contractors for construction. The front featured a dazzling 8 by 11 foot plate glass window. Since 1909 this building has been occupied by small businesses.",
      "geofence_buffer_in_meters": 10,
      "id": 427,
      "latitude": 41.6712709461022,
      "longitude": -91.3472387194633,
      "name": "Earliest Citizen's Savings Bank (1898), 110 W. Main Street",
      "type": "Bank"
    },
    {
      "description": "This building's exterior has had only minor alterations since its construction in 1895. Originally Rich's Golden Rule general store occupied one side of the building and Dr. J. I. bailey's medical offices occupied the other. Over the years a bakery, dry cleaning and men's clothing store, furnace and tin shop, antique shop, and grocery store were located here.",
      "geofence_buffer_in_meters": 10,
      "id": 431,
      "latitude": 41.6715855001847,
      "longitude": -91.3457179069519,
      "name": "Rich and Bailey Block (1895), 109 E. Main Street",
      "type": "Store"
    },
    {
      "description": "Behind the brick facade stands the wood frame building of Edwin Grinnell's drug store and H.T. Hollingsworth's watch repair. This building, the oldest surviving store, may date back to 1869. A series of jewelers and druggists occupied the building until 1924 when Fred Albin bought it for his meat market. He added the back room and brick facade.",
      "geofence_buffer_in_meters": 10,
      "id": 428,
      "latitude": 41.6712709461022,
      "longitude": -91.3474184274673,
      "name": "Grinnell Building (1869) 112 W. Main Street",
      "type": "Store"
    },
    {
      "description": "Built by Mayor S.C. Gruwell and businessman J.C. Crew shortly after the land was deeded in 1894, this is one of the older storefronts remaining along West Main Street, having been built shortly after the land was deeded in 1894. C.M. Paulsen had a music store here until a harness shop occupied the building in about 1910. it because a variety store in 1960. In recent years it has been the home of the West Branch Heritage Museum.",
      "geofence_buffer_in_meters": 10,
      "id": 426,
      "latitude": 41.6715253944278,
      "longitude": -91.3472601771355,
      "name": "Gruwell-Crew Building (1894), 109 W. Main Street)",
      "type": "Store"
    },
    {
      "description": "In 1904 Huldah Enlow donated the land and building for a public library. Later, an anonymous monetary gift financed construction of an expansion. In 1963, the front entrance was enclosed and in 1974, the basement was converted into a children's library. It remained a library until 1993.",
      "geofence_buffer_in_meters": 10,
      "id": 430,
      "latitude": 41.6712709461022,
      "longitude": -91.347895860672,
      "name": "Enlow Building (1904), 124 W. Main Street",
      "type": "Library"
    },
    {
      "description": "Caleb H. Wickersham, postmaster of West Branch, contracted construction of this building in 1906. One year later, Wickersham signed the federal government to a 10 year lease to house the post office. The post office relocated in 1928 and in the ensuing years the building housed a number of different business. The Old Post Office collapsed during renovation in 2011. The present building incorporates bricks and design features, like the arch, from the Old Post Office in its facade.",
      "geofence_buffer_in_meters": 10,
      "id": 429,
      "latitude": 41.6712729496363,
      "longitude": -91.3474828004837,
      "name": "Old Post Office (1907), 116 W. Main Street",
      "type": "Post Office"
    },
    {
      "description": "Boy Scouts built a picnic shelter in 1953 as a tribute to Herbert Hoover's long legacy of service to youth around the world. The next year, the former president accepted an invitation from the Iowa legislature to celebrate his 80th birthday in West Branch. After a speech at the new Herbert Hoover Elementary School, where an audience of 20,000 greeted him, Hoover arrived at the picnic shelter for a birthday lunch of fried chicken, corn, potato salad, and cake.",
      "geofence_buffer_in_meters": 10,
      "id": 411,
      "latitude": 41.6700547894262,
      "longitude": -91.3500174880028,
      "name": "Boy Scout Picnic Shelter",
      "type": "Picnic Shelter"
    },
    {
      "description": "Herbert Hoover Presidential Library and Museum opened to the public on August 10, 1962, Herbert Hoover's 88th birthday. The dedication took place at the library's original entrance, which is the small portico at the east end of the building supported by four white pillars and topped with an earlier version of the presidential seal. Since its opening, Herbert Hoover Presidential Library and Museum has been expanded and renovated several times, with the most recent change funded by a partnership between the U.S. government and the non-profit Hoover Presidential Foundation.",
      "geofence_buffer_in_meters": 10,
      "id": 389,
      "latitude": 41.6690029055671,
      "longitude": -91.3477778434753,
      "name": "Herbert Hoover Presidential Library and Museum (incl. WS)",
      "type": "Museum"
    },
    {
      "description": "This large brick structure, built in 1916, housed the West Branch State Bank (previously named West Branch Bank). It replaced a bank building (circa 1877) which stood on the same site, but was razed to make room for the new, larger building. The bank took temporary quarters across the street during construction. It then occupied this building until 1974. Fred Albin rented the back for his meat market until 1924. The West Branch Telephone Company shared the second floor with Hubbard & Hubbard Chiropractors.",
      "geofence_buffer_in_meters": 10,
      "id": 420,
      "latitude": 41.6715213873754,
      "longitude": -91.3468685746193,
      "name": "Old West Branch State Bank (1916), 101 W. Main Street",
      "type": "Bank"
    },
    {
      "description": "Herbert Hoover's father and mother, Jesse and Hulda, are buried among relatives at West Branch city cemetery.",
      "geofence_buffer_in_meters": 10,
      "id": 413,
      "latitude": 41.67726,
      "longitude": -91.35117,
      "name": "Graves of Jesse and Hulda Hoover - West Branch Cemetery",
      "type": "Graves"
    },
    {
      "description": "In 1870, Laban Miles had married Hulda Hoover’s younger sister, Agnes Minthorn, just five days after Hulda and Jesse Hoover were wed. By 1875 they were settling down in this house, built sometime between 1869 and 1872, with a family of their own.",
      "geofence_buffer_in_meters": 10,
      "id": 400,
      "latitude": 41.6709063018664,
      "longitude": -91.3463965058327,
      "name": "Laban Miles House",
      "type": "Office"
    }
  ],
  "tours": [],
  "urls": {
    "base_url_icon": "http://nationalparkservice.github.io/data/places_mobile/icons/",
    "base_url_media": "http://nationalparkservice.github.io/data/places_mobile/heho/media/"
  }
}