{
  "alerts": [],
  "categories": [],
  "description": "Cape Hatteras National Seashore",
  "designation": "National Seashore",
  "events": [
    {
      "description": "**Awesome** _Ranger_ Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour! Awesome Ranger Tour!",
      "frequency": "Mon,Tue,Wed,Thur,Fri,Sat,Sun",
      "home_description": "Awesome Ranger Tour!",
      "title": "Lighthouse Tour"
    },
    {
      "description": "Its a sunny day! Its a sunny day! Its a sunny day! Its a sunny day! Its a sunny day! Its a sunny day! Its a sunny day! Its a sunny day! Its a sunny day! ",
      "frequency": "Mon,Wed,Fri,Sat,Sun",
      "home_description": "Its a sunny day!",
      "title": "Go to the Beach!"
    }
  ],
  "map_thumbnail_zoom": 16,
  "max_distance_in_meters": 1609.3,
  "media": [
    {
      "id": 483,
      "image_thumbnail_1x": "494_thumbnail.png",
      "image_thumbnail_2x": "494_thumbnail@2x.png",
      "image_thumbnail_3x": "494_thumbnail@3x.png",
      "relative_url": "494.png",
      "relative_url_@2x": "494@2x.png",
      "relative_url_tablet": "494_tablet.png",
      "relative_url_tablet_@2x": "494_tablet@2x.png",
      "type": "map_thumbnail"
    },
    {
      "id": 481,
      "image_thumbnail_1x": "492_thumbnail.png",
      "image_thumbnail_2x": "492_thumbnail@2x.png",
      "image_thumbnail_3x": "492_thumbnail@3x.png",
      "relative_url": "492.png",
      "relative_url_@2x": "492@2x.png",
      "relative_url_tablet": "492_tablet.png",
      "relative_url_tablet_@2x": "492_tablet@2x.png",
      "type": "map_thumbnail"
    }
  ],
  "more": [],
  "name": "Cape Hatteras ",
  "searches": [],
  "sites": [
    {
      "audio_description": "AD Goes Here",
      "description": "The Cape Hatteras Lighthouse protects one of the most hazardous sections of the Atlantic Coast. Offshore of Cape Hatteras, the Gulf Stream collides with the Virginia Drift, a branch of the Labrador Current from Canada. This current forces southbound ships into a dangerous twelve-mile long sandbar called Diamond Shoals. Hundreds and possibly thousands of shipwrecks in this area have given it the reputation as the Graveyard of the Atlantic.\n",
      "geofence_buffer_in_meters": 25.23999951232002,
      "id": 492,
      "information": [
        {
          "description": "1794\tFirst tower is authorized by Congress.\n1803\tFirst tower is completed. It stood 90 feet tall, was built of sandstone, and used oil lamps to light the beacon.\n1854\tModifications included raising tower to 150 ft. and installing a new first order Fresnel lens that utilized prisms and focusing lenses to concentrate the light from an oil fired flame into a powerful beacon.\n1861\tConfederate forces try to destroy the tower, but were prevented by the Union forces. Confederates take the Fresnel lens with them.\n1862\tLight shines again but extensive repairs needed and studies show it would be less costly to replace the tower with a new tower.\n1867\t$75,000 appropriated by Congress for a new lighthouse. Final cost $167.500.\n1868\tConstruction of the second tower begins.\n1870\tConstruction completed. The first order Fresnel lens from the 1803 lighthouse is transferred to the new tower.\n1873\tBlack and white daymark striping ordered by the Lighthouse Board.\n1893\t1400 to 1500 feet from shoreline.\n1913\tIlluminant changed to incandescent oil vapor lamps.\n1919\tLess than 300 feet from shoreline!\n1930\tFirst groins installed.\n1933\tLess than 100 feet from shoreline, more groins installed.\n1934\tLamps electrified.\n1935\tErosion threatened base of the tower as waves washed against it. Lighthouse abandoned and replaced by skeleton steel structure a mile northwest of the brick tower.\n1936\tOwnership transferred to NPS. Civilian Conservation Corps (CCC) began building sand dunes along the Outer Banks to aid in erosion control.\n1939\tCCC guides give tours of lighthouse.\n1942–45\tLeased to US Coast Guard for use as observation tower during WWII.\n1945\t500 to 900 feet from shoreline.\n1946\tFresnel lens apparatus vandalized.\n1949\tFresnel lens removed from the tower, but the pedestal and clockwork were left in place.\n1950\tEroded sand stopped naturally and control work by CCC made it possible to transfer beacon back to the brick tower.\n1950–51\tNC Highway 12 constructed with ferry service at Oregon Inlet.\n1953\tCape Hatteras National Seashore established. Lighthouse opened to the public.\n1960\tUnknown quantities of sand pumped onto the shoreline.\n1972\t800,000-candlepower beacon installed, consisting of a rotary beacon with two 1000-watt lamps. Flashes every 7.5 seconds. This is the beacon that is present today.\n1975\t175 feet from shoreline. Structural cracks in tower led to its closing to the public.\n1980\t50 to 70 feet from shoreline.\n1981\tExperimental artificial sea grass is placed on shoreline. \"Save the Lighthouse Committee\" formed by US Senator Helms, Governor Hunt of North Carolina, and others.\n1984–93\tA 40-pound chunk of metal window trim fell to the ground, leading to the lighthouse being closed to public again.\n1987\tNPS requests independent study to save the lighthouse.\n1988\tIndependent study recommends relocation.\n1989\tNPS announces decision to move lighthouse when risk of leaving it outweighed the risk of moving it.\n1990\tRestoration of tower begins.\n1993\tRepairs completed and lighthouse again opens to the public.\n1994\tExterior repainting completed. NPS superintendent declares risk of leaving lighthouse now outweighs risk of moving it.\n1997\tReport released endorsing immediate relocation.\n1999\tOil house, two cisterns, double keepers' quarters and principal keeper's quarters move to new site in March. Later, the lighthouse moves 2900 ft in 23 days, moving it 1500 ft back from the ocean.\n2000\tLighthouse reopens for climbing.\n2001\tLighthouse closes to the public on June 11th due to repairs needing to be done on the stairs.\n2002\tPainted in December.\n2003\tOn April 18th, lighthouse reopens to the public.\n2006\tThe pedestal and clockwork removed from the tower and reunite with the lens at the Graveyard of the Atlantic Museum in Hatteras, NC, which is 10 miles southwest of the lighthouse.\n2014\tLighthouse repainting done during the spring and summer months.",
          "name": "Timeline"
        }
      ],
      "latitude": 35.250519,
      "longitude": -75.528836,
      "map_thumbnail_image": 481,
      "name": "Cape Hatteras Lighthouse",
      "type": "Historic Structure"
    },
    {
      "description": "Beach Access Ramp",
      "geofence_buffer_in_meters": 10,
      "id": 494,
      "latitude": 35.532296,
      "longitude": -75.472727,
      "map_thumbnail_image": 483,
      "name": "Ramp",
      "type": "Beach Access"
    }
  ],
  "tours": [],
  "urls": {
    "base_url_icon": "http://nationalparkservice.github.io/data/places_mobile/icons/",
    "base_url_media": "http://nationalparkservice.github.io/data/places_mobile/caha/media/"
  }
}